# под занавес этого местами странного курса - самое странное задание... ну собсно выполняю что спросили, то и делаем...
# кодирую строчку 'hello world' по алгоритму этого хоффмана...

# frequency chart:
# h - 1
# e - 1
# l - 3
# o - 2
# w - 1
# r - 1
# d - 1
# ' ' - 1

# tree:
#                    _____01________
#                   /               \
#                  01               01
#                 /  \             /  \
#                01   01          01   l
#               / \   / \        / \
#              h   e d  ' '     01   o
#                               / \
#                               w  r

# code chart:
# l =   11
# h =   000
# e =   001
# d =   010
# o =   101
# ' ' = 011
# r =   1001
# w =   1000

# 'hello world' = 000 001 11 11 101 011 1000 101 1001 11 010


